Tekla.Structures.Model.RebarOffsets
This class can be used to specify the offset and the shortenings to be applied at the start
and end of the bars to satisfy concrete cover and layering needs. This is only applicable to
frozen rebar sets and where the same values are to be applied to all of the bars, and all
legs in each bar.

Tekla.Structures.Model.RebarOffsets.AtDepth
Gets or sets the depth to offset each bar leg, not including bar radius.

Tekla.Structures.Model.RebarOffsets.Start
Gets or sets the distance from the start of the bar to the surface of the concrete.

Tekla.Structures.Model.RebarOffsets.End
Gets or sets the distance from the end of the bar to the surface of the concrete.

Tekla.Structures.Model.RebarOffsets.ToStruct(Tekla.Structures.ModelInternal.dotRebarOffsets_t@)
Assigns the values to the transfer struct.
p: The transfer struct.

Tekla.Structures.Model.RebarOffsets.FromStruct(Tekla.Structures.ModelInternal.dotRebarOffsets_t@)
Assigns the values from the transfer struct.
p: The transfer struct.